OdGeLibVersion.op_GreaterThanOrEqual(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input library version is greater than or equal to this library version.

OdGeLibVersion.op_GreaterThan(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input library version is greater than this library version.

OdGeLibVersion.op_LessThanOrEqual(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input library version is less than or equal to this library version.

OdGeLibVersion.op_LessThan(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input library version is less than this library version.

OdGeLibVersion.op_Inequality(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input interval is not identical to this interval.

OdGeLibVersion.op_Equality(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeLibVersion object.
\param libVersion     [in]  OdGeLibVersion object to compare.
\returns
A boolean value that indicates whether the input library version is identical to this library version.

OdGeLibVersion.setSchemaVersion(System.Byte)
\details
Sets the schema version of GeLib.
\param schema [in]  Schema version.

OdGeLibVersion.setCorrectiveVersion(System.Byte)
\details
Sets the corrective version of GeLib.
\param corrective [in]  Corrective version.

OdGeLibVersion.setMinorVersion(System.Byte)
\details
Sets the minor version of GeLib.
\param minor [in]  Minor version.

OdGeLibVersion.setMajorVersion(System.Byte)
\details
Sets the major version of GeLib.
\param major [in]  Major version.

OdGeLibVersion.schemaVersion
\details
Returns the schema version of GeLib.

OdGeLibVersion.correctiveVersion
\details
Returns the corrective version of GeLib.

OdGeLibVersion.minorVersion
\details
Returns the minor version of GeLib.

OdGeLibVersion.majorVersion
\details
Returns the major version of GeLib.

OdGeLibVersion.#ctor(System.Byte,System.Byte,System.Byte,System.Byte)
\details
Constructor for the OdGeLibVersion class.
\param major [in]  Major version.
\param minor [in]  Minor version.
\param corrective [in]  Corrective version.
\param schema [in]  Schema version.

OdGeLibVersion.#ctor(OdGeLibVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the OdGeLibVersion class.
\param source [in]  A OdGeLibVersion object to be copied.

OdGeLibVersion.#ctor
\details
Default constructor for the OdGeLibVersion class.